
&НаКлиентеПроцедура КомандаПровести(Команда)  	ДосрочноеЗакрытиеПакета(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата, ЭтотОбъект.Объект.Причина);	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение, Истина);
	Записать(ПараметрыЗаписи);
КонецПроцедуры    Процедура ДосрочноеЗакрытиеПакета(ПакетыОпционов, Дата, Причина)          ОбъектПакета = ПакетыОпционов.ПолучитьОбъект();
	ОбъектПакета.ДатаДосрочногоЗакрытия = ЭтотОбъект.Объект.Дата;
	ОбъектПакета.Статус = Перечисления.СтатусПакетаОпционов.Закрыт; // изменение статуса выбранного акета на "закрыт"    ОбъектПакета.Записать();  	
	Сообщить("Пакет опционов " + ОбъектПакета.Код + " (" + ОбъектПакета.Наименование + ") успешно закрыт по причине '" + ЭтотОбъект.Объект.Причина + "'!");   
КонецПроцедуры   

&НаКлиентеПроцедура ПолучениеФИОДержателяКоманда (Команда)          ПолучениеФИОДержателя();КонецПроцедуры  

Процедура ПолучениеФИОДержателя()
    // получение объекта текущего пакета
    ОбъектПакета = ЭтотОбъект.Объект.ПакетОпционов.ПолучитьОбъект();
    ЭтотОбъект.Объект.ДержательПакета = ОбъектПакета.Держатель;
Конецпроцедуры

 




