Функция РассчитатьВестинг(ДатаНачала, Срок, Количество) Экспорт    Если ДатаНачала = Неопределено Тогда        Возврат 0;    КонецЕсли;         ТекущаяДата = ТекущаяДата();    ВсегоНачислено = 0;        // Первый транш (25%)    ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаНачала, 12));    Если ДатаРасчета <= ТекущаяДата Тогда        НачисленныеОпционы = Окр((Количество * 1 / (Срок * 12))*12, 0);        ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы;    Иначе        Возврат 0;    КонецЕсли;        // Остальные ежемесячные начисления 
	Для i = 1 По (Срок * 12 - 12) Цикл        ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаРасчета, 1));                Если ДатаРасчета > ТекущаяДата Тогда            Прервать;        КонецЕсли;                НачисленныеОпционы = Окр(Количество * 1 / (Срок * 12), 0);              ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы; 
	
	КонецЦикла;  
	
	Если ВсегоНачислено > Количество Тогда
			ВсегоНачислено = Количество;
	КонецЕсли;
        Возврат ВсегоНачислено;КонецФункции      

&НаСервереПроцедура ОбновлениеСправочникаПакетыОпционов() Экспорт    // Получаем все элементы справочника ПакетыОпционов    ЭлементыСправочника = Справочники.ПакетыОпционов.Выбрать();        Пока ЭлементыСправочника.Следующий() Цикл        // Получаем текущий элемент        ТекущийЭлемент = ЭлементыСправочника.ПолучитьОбъект();                // Вычисляем вестинг для текущего элемента        КоличествоОпционов = МодульВестинга.РассчитатьВестинг(            ТекущийЭлемент.ДатаНачалаВестинга,
            ТекущийЭлемент.СрокВестинга,            ТекущийЭлемент.КоличествоОпционов        );                // Обновляем значение в справочнике        ТекущийЭлемент.ВызревшиеОпционы = КоличествоОпционов;                // Записываем изменения        ТекущийЭлемент.Записать();	КонецЦикла;   
КонецПроцедуры