
&НаКлиентеПроцедура ПродажаОпционовКоманда(Команда)  	
    ПродажаОпционов(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата); 
КонецПроцедуры

Процедура ПродажаОпционов(ПакетыОпционов, Дата)          Если ЭтотОбъект.Объект.КоличествоОпционовДляПродажи > ЭтотОбъект.Объект.ДоступныеОпционы Тогда        Сообщить("Ошибка: Количество опционов для продажи не может превышать доступные опционы!");        Отказ = Истина;          Возврат;	КонецЕсли; 
	
	ЗаписатьДок = Записать();  // запись текущего документа    
	// создание нового документа реализации	    Реализация = Документы.РеализацияОпционов.СоздатьДокумент();    Реализация.ПакетОпционов = ЭтотОбъект.Объект.ПакетОпционов;    
	Реализация.ДоступныеОпционы = ЭтотОбъект.Объект.ДоступныеОпционы;    Реализация.Количество = ЭтотОбъект.Объект.КоличествоОпционовДляПродажи;    Реализация.Дата = ЭтотОбъект.Объект.Дата;  
	Реализация.НомерЗаявки = ЭтотОбъект.Объект.Номер;
	Реализация.Статус = ЭтотОбъект.Объект.Статус;    Реализация.Записать();
	
	    Сообщить("Заявка на продажу опционов отправлена. Номер заявки " + ЭтотОбъект.Объект.Номер);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПолучениеДоступныхОпционовКоманда(Команда)
	 ПолучениеДоступныхОпционов(ЭтотОбъект.Объект.ПакетОпционов)
КонецПроцедуры   

Процедура ПолучениеДоступныхОпционов(ПакетыОпционов)
	ОбъектПакета = ПакетыОпционов.ПолучитьОбъект(); // получение текущего пакета опционов
	ЭтотОбъект.Объект.ДоступныеОпционы = ПакетыОпционов.ОстатокОпционов;
КонецПроцедуры 








