Функция ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма) Экспорт
	Попытка 
		Профиль = Новый ИнтернетПочтовыйПрофиль;
	   Профиль.ИспользоватьSSLSMTP = Истина;
	   Профиль.АдресСервераSMTP = "smtp.yandex.ru"; 
	   Профиль.ПользовательSMTP = "ESOP-1C-men@yandex.ru"; 
	   Профиль.ПарольSMTP = "tafckfpvxfrqpnrh"; 
	   Профиль.ПортSMTP = 465; 
	   Профиль.ИспользоватьSSLSMTP = Истина; 
	   Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login; 
    
    
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Получатели.Добавить(АдресПолучателя);
		Сообщение.Тема = ТемаПисьма; 
		Сообщение.Тексты.Добавить(ТекстПисьма);
		СтрокаСАдресомОтправителя = Профиль.ПользовательSMTP;
		Сообщение.Отправитель.Адрес = СтрокаСАдресомОтправителя;
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
        Сообщить("Письмо успешно отправлено на адрес " + АдресПолучателя + "!", СтатусСообщения.Обычное);
 
    Исключение
        Сообщить("Ошибка при отправке письма: " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
    КонецПопытки;    
КонецФункции
