
Процедура ОбработкаПроведения(Отказ, Режим)
			//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.ПакетОпционов = ПакетОпционов;
	Движение.ДержательОпционов = ПакетОпционов.Держатель;
	Движение.ДатаПродажи = Дата;
	Движение.КоличествоОпционов = Количество;
	Движение.ОстатокОпционовВПакете = ДоступныеОпционы-Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 	
	
	ОбъектДержателя = ЭтотОбъект.ПакетОпционов.Держатель.ПолучитьОбъект();
	АдресПолучателя = ОбъектДержателя.Почта;  
	ФИОПолучателя = ОбъектДержателя.ФИО;  
	ОбъектПакета = ЭтотОбъект.ПакетОпционов.ПолучитьОбъект();
	Если ЭтотОбъект.ПричинаОтклонения <> "" Тогда
		ТемаПисьма = "Заявка на продажу опционов отклонена❌";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " + Символы.ПС +   Символы.ПС +       
		              "Ваша заявка на продажу опционов №" + ЭтотОбъект.НомерЗаявки + " отклонена по причине '" + ЭтотОбъект.ПричинаОтклонения + "'❌." + Символы.ПС + Символы.ПС +
					  "Детали заявки: " +  Символы.ПС +	  
					  "⏰Дата оформления заявки: " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +
					  "✉️ Пакет опционов: " + ОбъектПакета.Код + " (" + ЭтотОбъект.ПакетОпционов + ")." +  Символы.ПС + Символы.ПС + 
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки:" +  Символы.ПС + 
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

       	Иначе
		ТемаПисьма = "Заявка на продажу опционов одобрена✅";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " +  Символы.ПС + Символы.ПС +	        
		              "Ваша заявка на продажу опционов №" + ЭтотОбъект.НомерЗаявки + " успешно одобрена✅" + Символы.ПС + Символы.ПС +
					  "Детали заявки: " +  Символы.ПС +	  
					  "⏰Дата оформления заявки: " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС + 
					"✨Наименование пакета опционов: " + ЭтотОбъект.ПакетОпционов + "." +  Символы.ПС + 
					  "⭐ Количество проданных опционов : " + ЭтотОбъект.Количество + " шт." +  Символы.ПС +
					"☺️Остаток опционов в пакете: " + ЭтотОбъект.ПакетОпционов.ОстатокОпционов + " шт." +  Символы.ПС + Символы.ПС + 
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки:" +  Символы.ПС + 
		            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

	КонецЕсли;  
		
МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	
КонецПроцедуры        
