&НаСервере     

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)        // получение имени текущего пользователя    ИмяТекущегоПользователя = ПолноеИмяПользователя();        // поиск в справочнике "ДержателиОпционов"
    ТекПользователь = Неопределено;
    ВыборкаПользователя = Справочники.ДержателиОпционов.Выбрать();
    Пока ВыборкаПользователя.Следующий() Цикл
        Если ВыборкаПользователя.ФИО = ИмяТекущегоПользователя Тогда
            ТекПользователь = ВыборкаПользователя.Ссылка;
			 ПараметрыСеанса.ТекущийПользователь = ТекПользователь;   // установвка параметра сеанса
            Прервать;
        КонецЕсли;
    КонецЦикла;            	        //  поиск сотрудника по наименованию    ТекРаботник = Справочники.КадрыКомпании.НайтиПоНаименованию(ИмяТекущегоПользователя); 

    	// если пользователь не найден ни в одном справочнике, добавляем его в "ДержателиОпционов"
    Если ТекПользователь = Неопределено И ТекРаботник = Неопределено Тогда
        Попытка
            НовПользователь = Справочники.ДержателиОпционов.СоздатьЭлемент();
            НовПользователь.ФИО = ИмяТекущегоПользователя;
            НовПользователь.Записать();
            ТекПользователь = НовПользователь.Ссылка;    
			 ПараметрыСеанса.ТекущийПользователь = ТекПользователь;   // установвка параметра сеанса

            Сообщить("Пользователь " + ИмяТекущегоПользователя + " добавлен в справочник ДержателиОпционов.");
        Исключение
            Сообщить("Ошибка при создании пользователя " + ИмяТекущегоПользователя, СтатусСообщения.Ошибка);
            Возврат;
        КонецПопытки;
    КонецЕсли;
    	        ПараметрыСеанса.ТекущийРаботник = ТекРаботник;    // установвка параметра сеанса		МодульВестинга.ОбновлениеСправочникаПакетыОпционов();КонецПроцедуры