Процедура ПередЗаписью (Отказ)   
	Если ЭтоНовый() Тогда
		ОбъектПакета = ЭтотОбъект.ПакетОпционов.Держатель.ПолучитьОбъект();
		АдресПолучателя = ОбъектПакета.Почта;  
		ФИОПолучателя = ОбъектПакета.ФИО;
		ТемаПисьма = "Новая заявка на продажу опционов✍️";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " +  Символы.ПС + Символы.ПС +	        
		              "Ваша заявка на продажу опционов успешно оформлена☑️" + Символы.ПС + Символы.ПС +
					  "Детали заявки: " +  Символы.ПС +	  
					  "⏰Дата оформления заявки: " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +
					  "✉️Наименование пакета опционов: " + ЭтотОбъект.ПакетОпционов + "." +  Символы.ПС + 
					  "⭐Количество опционов для продажи: " + ЭтотОбъект.КоличествоОпционовДляПродажи + " шт." +  Символы.ПС +  Символы.ПС + 
					"Пожалуйста, ожидайте рассмотрения заявки. Обычно на это требуется 1 рабочий день.⏳" +  Символы.ПС +  Символы.ПС +
					"⚠️Если у вас возникли вопросы или вы не инициировали эту операцию, пожалуйста, сообщите в службу поддержки:" +  Символы.ПС + 
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";
					
		МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);   
	КонецЕсли;
	
КонецПроцедуры