Процедура ПриПроведении()    // Получаем запись из справочника    ПакетОпционов = Справочники.ПакетыОпционов.НайтиПоСсылке(ЭтотОбъект.ПакетОпционов);    Если ПакетОпционов = Неопределено Тогда    	ВызватьИсключение "Ошибка: Пакет опционов не найден!";
	КонецЕсли;    Если ЭтотОбъект.Объект.Количество > ПакетОпционов.ВызревшиеОпционы Тогда
        Сообщить("Ошибка: Количество опционов для продажи не может превышать доступные опционы!");
        Отказ = Истина;  
        Возврат;
	КонецЕсли;         // Обновляем данные в справочнике    ПакетОпционов.ВызревшиеОпционы = ПакетОпционов.ВызревшиеОпционы - ЭтотОбъект.Количество;    ПакетОпционов.ПроданныеОпционы = ПакетОпционов.ПроданныеОпционы + ЭтотОбъект.Количество;    ПакетОпционов.ОстатокОпционовВПакете = ПакетОпционов.ВызревшиеОпционы - ПакетОпционов.ПроданныеОпционы;        // Сохраняем изменения    ПакетОпционов.Записать();КонецПроцедуры      

Процедура ОбработкаПроведения(Отказ, Режим)
	ОбъектДержателя = ЭтотОбъект.ПакетОпционов.Держатель.ПолучитьОбъект();
	АдресПолучателя = ОбъектДержателя.Почта;  
	ФИОПолучателя = ОбъектДержателя.ФИО;         
	ОбъектПакета = ЭтотОбъект.ПакетОпционов.ПолучитьОбъект();
	ТемаПисьма = "Закрытие пакета опционов❗️";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " + Символы.ПС + Символы.ПС +         
		              "Ваш пакет опционов №" + ОбъектПакета.Код + " (" + ОбъектПакета.Наименование + ") закрыт по причине '" + ЭтотОбъект.Причина + "'!✉️" + Символы.ПС + Символы.ПС +
					  "Детали: " +  Символы.ПС +	  
					  "⏰Дата начала вестинга: " + Формат(ОбъектПакета.ДатаНачалаВестинга, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +
					  "⭐Остаток опционов в пакете: " + ОбъектПакета.ОстатокОпционов + "." +  Символы.ПС + Символы.ПС +  
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки, указав номер заявки " + ЭтотОбъект.Номер + ":" +  Символы.ПС + 
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

				
МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	
КонецПроцедуры        


