Процедура ПередЗаписью(Отказ)
	ВызревшиеОпционы = МодульВестинга.РассчитатьВестинг(ЭтотОбъект.ДатаНачалаВестинга, ЭтотОбъект.СрокВестинга, ЭтотОбъект.КоличествоОпционов);
	ЭтотОбъект.ВызревшиеОпционы = ВызревшиеОпционы;
	ЭтотОбъект.ОстатокОпционов = ВызревшиеОпционы - ЭтотОбъект.ПроданныеОпционы;  
	
	Если (ТекущаяДата() >= ДобавитьМесяц(ЭтотОбъект.ДатаНачалаВестинга, ЭтотОбъект.СрокВестинга * 12)) И 
       (ЭтотОбъект.ПроданныеОпционы = ЭтотОбъект.КоличествоОпционов) Тогда
        ЭтотОбъект.Статус = Перечисления.СтатусПакетаОпционов.Закрыт;
	КонецЕсли;    
	Если ЭтоНовый() Тогда	   	ОбъектДержателя = ЭтотОбъект.Держатель.ПолучитьОбъект();
		АдресПолучателя = ОбъектДержателя.Почта;
		ФИОПолучателя = ОбъектДержателя.ФИО;
		ТемаПисьма = "Новый пакет опционов ✔️" ;

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " +  Символы.ПС + Символы.ПС +	        
	                  "Рады сообщить, что вам начислен новый пакет опционов.✨" +  Символы.ПС + Символы.ПС +
					  "Детали пакета: " +  Символы.ПС +	 
					"☺️Наименование пакета: " + ЭтотОбъект.Наименование + "." + Символы.ПС +
					  "⏰Дата начала вестинга: " + Формат(ЭтотОбъект.ДатаНачалаВестинга, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +	
					  "⭐Количество опционов в пакете: " + ЭтотОбъект.КоличествоОпционов + "." +  Символы.ПС + 
					  "⏳Срок вестинга: " + ЭтотОбъект.СрокВестинга + " год (лет)." +  Символы.ПС +  Символы.ПС + 
					"Вы можете ознакомиться с подробными условиями в личном кабинете.☑️" +  Символы.ПС +  Символы.ПС +  
					"Если у вас возникли вопросы, наша служба поддержки всегда готова помочь:" + Символы.ПС +
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";
		
	МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	КонецЕсли;



КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


